/* Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 */

Console.WriteLine("enter the number");
int num = int.Parse(Console.ReadLine());

if (num >= 100)
{
    int num == num / 10;
}
